; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-u-2)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	infrared1 - mode
	image2 - mode
	infrared0 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Planet3 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Star16 - direction
	Planet17 - direction
	Star18 - direction
	Phenomenon19 - direction
	Phenomenon20 - direction
	Planet21 - direction
	Planet22 - direction
	Phenomenon23 - direction
	Phenomenon24 - direction
	Star25 - direction
	Phenomenon26 - direction
	Phenomenon27 - direction
	Star28 - direction
	Planet29 - direction
	Phenomenon30 - direction
	Phenomenon31 - direction
	Phenomenon32 - direction
	Planet33 - direction
	Planet34 - direction
	Planet35 - direction
	Star36 - direction
	Star37 - direction
	Phenomenon38 - direction
	Planet39 - direction
	Star40 - direction
	Star41 - direction
	Star42 - direction
	Phenomenon43 - direction
	Star44 - direction
	Planet45 - direction
	Planet46 - direction
	Phenomenon47 - direction
	Phenomenon48 - direction
	Planet49 - direction
	Planet50 - direction
	Planet51 - direction
	Phenomenon52 - direction
)
(:init
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet50)
	(supports instrument1 image2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 image2)
	(supports instrument2 infrared1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument3 infrared1)
	(supports instrument3 image2)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star0)
	(supports instrument4 infrared1)
	(supports instrument4 infrared0)
	(supports instrument4 image2)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 infrared1)
	(supports instrument5 image2)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet8)
	(supports instrument6 infrared1)
	(supports instrument6 image2)
	(calibration_target instrument6 Star0)
	(supports instrument7 infrared0)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet12)
	(supports instrument8 image2)
	(calibration_target instrument8 GroundStation2)
	(supports instrument9 infrared0)
	(calibration_target instrument9 GroundStation1)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet8)
)
(:goal (and
	(pointing satellite1 Planet46)
	(pointing satellite2 Phenomenon48)
	(have_image Planet3 infrared0)
	(have_image Planet4 infrared0)
	(have_image Phenomenon5 image2)
	(have_image Phenomenon6 infrared0)
	(have_image Star7 infrared0)
	(have_image Planet9 infrared0)
	(have_image Star10 infrared0)
	(have_image Star11 infrared1)
	(have_image Planet13 infrared1)
	(have_image Star18 infrared1)
	(have_image Phenomenon19 infrared0)
	(have_image Planet21 image2)
	(have_image Planet22 image2)
	(have_image Phenomenon23 infrared1)
	(have_image Phenomenon24 infrared1)
	(have_image Star25 image2)
	(have_image Phenomenon26 infrared1)
	(have_image Phenomenon27 infrared0)
	(have_image Star28 infrared1)
	(have_image Planet29 image2)
	(have_image Phenomenon30 image2)
	(have_image Phenomenon31 image2)
	(have_image Phenomenon32 image2)
	(have_image Planet33 infrared0)
	(have_image Planet34 infrared1)
	(have_image Planet35 image2)
	(have_image Star36 infrared1)
	(have_image Star37 infrared1)
	(have_image Phenomenon38 infrared0)
	(have_image Planet39 infrared0)
	(have_image Star40 image2)
	(have_image Star41 image2)
	(have_image Star42 infrared0)
	(have_image Phenomenon43 infrared0)
	(have_image Star44 image2)
	(have_image Planet45 image2)
	(have_image Planet46 image2)
	(have_image Phenomenon47 infrared0)
	(have_image Phenomenon48 infrared1)
	(have_image Planet49 infrared1)
	(have_image Planet50 infrared0)
	(have_image Planet51 image2)
	(have_image Phenomenon52 infrared1)
))

)

; plan
1. (turn_to satellite0 groundstation2 planet50)
   deleted: (pointing satellite0 planet50)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 45
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 45
3. (turn_to satellite2 star0 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star0)
   goals met: 0 of 45
4. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 45
5. (calibrate satellite2 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 0 of 45
6. (turn_to satellite2 planet3 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 planet3)
   goals met: 0 of 45
7. (take_image satellite2 planet3 instrument3 infrared0)
   added: (have_image planet3 infrared0)
   goals met: 1 of 45
8. (turn_to satellite2 planet4 planet3)
   deleted: (pointing satellite2 planet3)
   added: (pointing satellite2 planet4)
   goals met: 1 of 45
9. (take_image satellite2 planet4 instrument3 infrared0)
   added: (have_image planet4 infrared0)
   goals met: 2 of 45
10. (turn_to satellite2 phenomenon5 planet4)
   deleted: (pointing satellite2 planet4)
   added: (pointing satellite2 phenomenon5)
   goals met: 2 of 45
11. (take_image satellite2 phenomenon5 instrument3 image2)
   added: (have_image phenomenon5 image2)
   goals met: 3 of 45
12. (turn_to satellite2 phenomenon6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon6)
   goals met: 3 of 45
13. (take_image satellite2 phenomenon6 instrument3 infrared0)
   added: (have_image phenomenon6 infrared0)
   goals met: 4 of 45
14. (turn_to satellite2 star7 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 star7)
   goals met: 4 of 45
15. (take_image satellite2 star7 instrument3 infrared0)
   added: (have_image star7 infrared0)
   goals met: 5 of 45
16. (turn_to satellite2 planet9 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 planet9)
   goals met: 5 of 45
17. (take_image satellite2 planet9 instrument3 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 6 of 45
18. (turn_to satellite2 star10 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star10)
   goals met: 6 of 45
19. (take_image satellite2 star10 instrument3 infrared0)
   added: (have_image star10 infrared0)
   goals met: 7 of 45
20. (turn_to satellite2 star11 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star11)
   goals met: 7 of 45
21. (take_image satellite2 star11 instrument3 infrared1)
   added: (have_image star11 infrared1)
   goals met: 8 of 45
22. (turn_to satellite2 planet13 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 planet13)
   goals met: 8 of 45
23. (take_image satellite2 planet13 instrument3 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 9 of 45
24. (turn_to satellite2 star18 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 star18)
   goals met: 9 of 45
25. (take_image satellite2 star18 instrument3 infrared1)
   added: (have_image star18 infrared1)
   goals met: 10 of 45
26. (turn_to satellite2 phenomenon19 star18)
   deleted: (pointing satellite2 star18)
   added: (pointing satellite2 phenomenon19)
   goals met: 10 of 45
27. (take_image satellite2 phenomenon19 instrument3 infrared0)
   added: (have_image phenomenon19 infrared0)
   goals met: 11 of 45
28. (turn_to satellite2 planet21 phenomenon19)
   deleted: (pointing satellite2 phenomenon19)
   added: (pointing satellite2 planet21)
   goals met: 11 of 45
29. (take_image satellite2 planet21 instrument3 image2)
   added: (have_image planet21 image2)
   goals met: 12 of 45
30. (turn_to satellite2 planet22 planet21)
   deleted: (pointing satellite2 planet21)
   added: (pointing satellite2 planet22)
   goals met: 12 of 45
31. (take_image satellite2 planet22 instrument3 image2)
   added: (have_image planet22 image2)
   goals met: 13 of 45
32. (turn_to satellite2 phenomenon23 planet22)
   deleted: (pointing satellite2 planet22)
   added: (pointing satellite2 phenomenon23)
   goals met: 13 of 45
33. (take_image satellite2 phenomenon23 instrument3 infrared1)
   added: (have_image phenomenon23 infrared1)
   goals met: 14 of 45
34. (turn_to satellite2 phenomenon24 phenomenon23)
   deleted: (pointing satellite2 phenomenon23)
   added: (pointing satellite2 phenomenon24)
   goals met: 14 of 45
35. (take_image satellite2 phenomenon24 instrument3 infrared1)
   added: (have_image phenomenon24 infrared1)
   goals met: 15 of 45
36. (turn_to satellite2 star25 phenomenon24)
   deleted: (pointing satellite2 phenomenon24)
   added: (pointing satellite2 star25)
   goals met: 15 of 45
37. (take_image satellite2 star25 instrument3 image2)
   added: (have_image star25 image2)
   goals met: 16 of 45
38. (turn_to satellite2 phenomenon26 star25)
   deleted: (pointing satellite2 star25)
   added: (pointing satellite2 phenomenon26)
   goals met: 16 of 45
39. (take_image satellite2 phenomenon26 instrument3 infrared1)
   added: (have_image phenomenon26 infrared1)
   goals met: 17 of 45
40. (turn_to satellite2 phenomenon27 phenomenon26)
   deleted: (pointing satellite2 phenomenon26)
   added: (pointing satellite2 phenomenon27)
   goals met: 17 of 45
41. (take_image satellite2 phenomenon27 instrument3 infrared0)
   added: (have_image phenomenon27 infrared0)
   goals met: 18 of 45
42. (turn_to satellite2 star28 phenomenon27)
   deleted: (pointing satellite2 phenomenon27)
   added: (pointing satellite2 star28)
   goals met: 18 of 45
43. (take_image satellite2 star28 instrument3 infrared1)
   added: (have_image star28 infrared1)
   goals met: 19 of 45
44. (turn_to satellite2 planet29 star28)
   deleted: (pointing satellite2 star28)
   added: (pointing satellite2 planet29)
   goals met: 19 of 45
45. (take_image satellite2 planet29 instrument3 image2)
   added: (have_image planet29 image2)
   goals met: 20 of 45
46. (turn_to satellite2 phenomenon30 planet29)
   deleted: (pointing satellite2 planet29)
   added: (pointing satellite2 phenomenon30)
   goals met: 20 of 45
47. (take_image satellite2 phenomenon30 instrument3 image2)
   added: (have_image phenomenon30 image2)
   goals met: 21 of 45
48. (turn_to satellite2 phenomenon31 phenomenon30)
   deleted: (pointing satellite2 phenomenon30)
   added: (pointing satellite2 phenomenon31)
   goals met: 21 of 45
49. (take_image satellite2 phenomenon31 instrument3 image2)
   added: (have_image phenomenon31 image2)
   goals met: 22 of 45
50. (turn_to satellite2 phenomenon32 phenomenon31)
   deleted: (pointing satellite2 phenomenon31)
   added: (pointing satellite2 phenomenon32)
   goals met: 22 of 45
51. (take_image satellite2 phenomenon32 instrument3 image2)
   added: (have_image phenomenon32 image2)
   goals met: 23 of 45
52. (turn_to satellite2 planet33 phenomenon32)
   deleted: (pointing satellite2 phenomenon32)
   added: (pointing satellite2 planet33)
   goals met: 23 of 45
53. (take_image satellite2 planet33 instrument3 infrared0)
   added: (have_image planet33 infrared0)
   goals met: 24 of 45
54. (turn_to satellite2 planet34 planet33)
   deleted: (pointing satellite2 planet33)
   added: (pointing satellite2 planet34)
   goals met: 24 of 45
55. (take_image satellite2 planet34 instrument3 infrared1)
   added: (have_image planet34 infrared1)
   goals met: 25 of 45
56. (turn_to satellite2 planet35 planet34)
   deleted: (pointing satellite2 planet34)
   added: (pointing satellite2 planet35)
   goals met: 25 of 45
57. (take_image satellite2 planet35 instrument3 image2)
   added: (have_image planet35 image2)
   goals met: 26 of 45
58. (turn_to satellite2 star36 planet35)
   deleted: (pointing satellite2 planet35)
   added: (pointing satellite2 star36)
   goals met: 26 of 45
59. (take_image satellite2 star36 instrument3 infrared1)
   added: (have_image star36 infrared1)
   goals met: 27 of 45
60. (turn_to satellite2 star37 star36)
   deleted: (pointing satellite2 star36)
   added: (pointing satellite2 star37)
   goals met: 27 of 45
61. (take_image satellite2 star37 instrument3 infrared1)
   added: (have_image star37 infrared1)
   goals met: 28 of 45
62. (turn_to satellite2 phenomenon38 star37)
   deleted: (pointing satellite2 star37)
   added: (pointing satellite2 phenomenon38)
   goals met: 28 of 45
63. (take_image satellite2 phenomenon38 instrument3 infrared0)
   added: (have_image phenomenon38 infrared0)
   goals met: 29 of 45
64. (turn_to satellite2 planet39 phenomenon38)
   deleted: (pointing satellite2 phenomenon38)
   added: (pointing satellite2 planet39)
   goals met: 29 of 45
65. (take_image satellite2 planet39 instrument3 infrared0)
   added: (have_image planet39 infrared0)
   goals met: 30 of 45
66. (turn_to satellite2 star40 planet39)
   deleted: (pointing satellite2 planet39)
   added: (pointing satellite2 star40)
   goals met: 30 of 45
67. (take_image satellite2 star40 instrument3 image2)
   added: (have_image star40 image2)
   goals met: 31 of 45
68. (turn_to satellite2 star41 star40)
   deleted: (pointing satellite2 star40)
   added: (pointing satellite2 star41)
   goals met: 31 of 45
69. (take_image satellite2 star41 instrument3 image2)
   added: (have_image star41 image2)
   goals met: 32 of 45
70. (turn_to satellite2 star42 star41)
   deleted: (pointing satellite2 star41)
   added: (pointing satellite2 star42)
   goals met: 32 of 45
71. (take_image satellite2 star42 instrument3 infrared0)
   added: (have_image star42 infrared0)
   goals met: 33 of 45
72. (turn_to satellite2 phenomenon43 star42)
   deleted: (pointing satellite2 star42)
   added: (pointing satellite2 phenomenon43)
   goals met: 33 of 45
73. (take_image satellite2 phenomenon43 instrument3 infrared0)
   added: (have_image phenomenon43 infrared0)
   goals met: 34 of 45
74. (turn_to satellite2 star44 phenomenon43)
   deleted: (pointing satellite2 phenomenon43)
   added: (pointing satellite2 star44)
   goals met: 34 of 45
75. (take_image satellite2 star44 instrument3 image2)
   added: (have_image star44 image2)
   goals met: 35 of 45
76. (turn_to satellite2 planet45 star44)
   deleted: (pointing satellite2 star44)
   added: (pointing satellite2 planet45)
   goals met: 35 of 45
77. (take_image satellite2 planet45 instrument3 image2)
   added: (have_image planet45 image2)
   goals met: 36 of 45
78. (turn_to satellite2 planet46 planet45)
   deleted: (pointing satellite2 planet45)
   added: (pointing satellite2 planet46)
   goals met: 36 of 45
79. (take_image satellite2 planet46 instrument3 image2)
   added: (have_image planet46 image2)
   goals met: 37 of 45
80. (turn_to satellite2 phenomenon47 planet46)
   deleted: (pointing satellite2 planet46)
   added: (pointing satellite2 phenomenon47)
   goals met: 37 of 45
81. (take_image satellite2 phenomenon47 instrument3 infrared0)
   added: (have_image phenomenon47 infrared0)
   goals met: 38 of 45
82. (turn_to satellite2 planet49 phenomenon47)
   deleted: (pointing satellite2 phenomenon47)
   added: (pointing satellite2 planet49)
   goals met: 38 of 45
83. (take_image satellite2 planet49 instrument3 infrared1)
   added: (have_image planet49 infrared1)
   goals met: 39 of 45
84. (turn_to satellite2 planet50 planet49)
   deleted: (pointing satellite2 planet49)
   added: (pointing satellite2 planet50)
   goals met: 39 of 45
85. (take_image satellite2 planet50 instrument3 infrared0)
   added: (have_image planet50 infrared0)
   goals met: 40 of 45
86. (turn_to satellite2 planet51 planet50)
   deleted: (pointing satellite2 planet50)
   added: (pointing satellite2 planet51)
   goals met: 40 of 45
87. (take_image satellite2 planet51 instrument3 image2)
   added: (have_image planet51 image2)
   goals met: 41 of 45
88. (turn_to satellite2 phenomenon52 planet51)
   deleted: (pointing satellite2 planet51)
   added: (pointing satellite2 phenomenon52)
   goals met: 41 of 45
89. (take_image satellite2 phenomenon52 instrument3 infrared1)
   added: (have_image phenomenon52 infrared1)
   goals met: 42 of 45
90. (turn_to satellite1 planet46 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet46)
   goals met: 43 of 45
91. (turn_to satellite2 phenomenon48 phenomenon52)
   deleted: (pointing satellite2 phenomenon52)
   added: (pointing satellite2 phenomenon48)
   goals met: 44 of 45
92. (take_image satellite2 phenomenon48 instrument3 infrared1)
   added: (have_image phenomenon48 infrared1)
   goals met: 45 of 45
